pfm/tutorials/multiphase/twoPhaseEulerTurbFoam/KT/stepResponseFluidizedBed/0.orig/U.air
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    vin_DB
    {
        type            interstitialInletVelocity;
        inletVelocity   uniform (0 0 0.63);
        alpha           alpha.air;
        value           $internalField;
    }

    pout
    {
        type            pressureInletOutletVelocity;
        phi             phi.air;
        value           $internalField;
    }

    w_F
    {
        type            cyclic;
    }
    w_B
    {
        type            cyclic;
    }
    w_L
    {
        type            cyclic;
    }
    w_R
    {
        type            cyclic;
    }
}

// ************************************************************************* //
