pfm/tutorials/multiphase/twoPhaseEulerTurbFoam/KT/stepResponseFluidizedBed/constant/thermophysicalProperties.air
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        nMoles      1;
        molWeight   28.97;
    }
    thermodynamics
    {
        Cp          1005;
        Hf          0;
    }
    equationOfState
    {
        rho         1.224;
    }
    transport
    {
        mu          1.78e-05;
        Pr          0.7;
        Prt         1.0;
    }
}


// ************************************************************************* //
