pfm/tutorials/multiphase/twoPhaseEulerTurbFoam/KT/stepResponseFluidizedBed/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.air 0.9999
    volScalarFieldValue alpha.particles 0.0001
);

regions
(
    boxToCell
    {
        box ( -0.023 -0.023 0) ( 0.023 0.023 0.4 );
        fieldValues
        (
            volScalarFieldValue alpha.air 0.45
            volScalarFieldValue alpha.particles 0.55
        );
    }
    boxToCell
    {
        box ( -0.023 -0.023 0 ) ( -0.002 0.023 0.1 );
        fieldValues
        (
            volScalarFieldValue alpha.air 0.7
            volScalarFieldValue alpha.particles 0.3
        );
    }
);


// ************************************************************************* //
